In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
csv_file = "Resources/HT_2013-2020.csv"
human_traffic_df = pd.read_csv(csv_file)
human_traffic_df.head()

,DATA_YEAR,ORI,PUB_AGENCY_NAME,PUB_AGENCY_UNIT,AGENCY_TYPE_NAME,STATE_ABBR,STATE_NAME,DIVISION_NAME,COUNTY_NAME,REGION_NAME,POPULATION_GROUP_CODE,POPULATION_GROUP_DESC,OFFENSE_SUBCAT_ID,OFFENSE_NAME,OFFENSE_SUBCAT_NAME,ACTUAL_COUNT,UNFOUNDED_COUNT,CLEARED_COUNT,JUVENILE_CLEARED_COUNT
0,2016,MO0480600,Independence,NaN,City,MO,Missouri,West North Central,JACKSON,Midwest,"100,000-249,000","Cities from 100,000 thru 249,999",81,Human Trafficking,Commercial Sex Acts,2,0,2,0
1,2016,TX2201200,Fort Worth,NaN,City,TX,Texas,West South Central,PARKER; DENTON; TARRANT,South,"500,000-999,999","Cities from 500,000 thru 999,999",82,Human Trafficking,Involuntary Servitude,1,0,0,0
2,2016,TX2270100,Austin,NaN,City,TX,Texas,West South Central,WILLIAMSON; TRAVIS,South,"500,000-999,999","Cities from 500,000 thru 999,999",82,Human Trafficking,Involuntary Servitude,2,0,0,0
3,2019,NV0020100,Las Vegas Metropolitan Police Department,NaN,City,NV,Nevada,Mountain,CLARK,West,"1,000,000","Cities 1,000,000 or over",81,Human Trafficking,Commercial Sex Acts,15,0,4,0
4,2017,AZ0070500,Chandler,NaN,City,AZ,Arizona,Mountain,MARICOPA,West,"100,000-249,000","Cities from 100,000 thru 249,999",81,Human Trafficking,Commercial Sex Acts,1,0,0,0

In [4]:
index_names = human_traffic_df[ human_traffic_df['AGENCY_TYPE_NAME'] == 'City' ].index

human_traffic_df.drop(index_names, inplace = True)
  
human_traffic_df

,DATA_YEAR,ORI,PUB_AGENCY_NAME,PUB_AGENCY_UNIT,AGENCY_TYPE_NAME,STATE_ABBR,STATE_NAME,DIVISION_NAME,COUNTY_NAME,REGION_NAME,POPULATION_GROUP_CODE,POPULATION_GROUP_DESC,OFFENSE_SUBCAT_ID,OFFENSE_NAME,OFFENSE_SUBCAT_NAME,ACTUAL_COUNT,UNFOUNDED_COUNT,CLEARED_COUNT,JUVENILE_CLEARED_COUNT
7,2020,GA0440200,DeKalb County Police Department,NaN,County,GA,Georgia,South Atlantic,DEKALB,South,"100,000","MSA counties 100,000 or over",81,Human Trafficking,Commercial Sex Acts,2,0,0,0
8,2020,GA0440200,DeKalb County Police Department,NaN,County,GA,Georgia,South Atlantic,DEKALB,South,"100,000","MSA counties 100,000 or over",82,Human Trafficking,Involuntary Servitude,1,0,0,0
9,2020,GA0440200,DeKalb County Police Department,NaN,County,GA,Georgia,South Atlantic,DEKALB,South,"100,000","MSA counties 100,000 or over",81,Human Trafficking,Commercial Sex Acts,2,0,1,0
10,2020,GA0440200,DeKalb County Police Department,NaN,County,GA,Georgia,South Atlantic,DEKALB,South,"100,000","MSA counties 100,000 or over",81,Human Trafficking,Commercial Sex Acts,5,0,0,0
11,2020,GA0440200,DeKalb County Police Department,NaN,County,GA,Georgia,South Atlantic,DEKALB,South,"100,000","MSA counties 100,000 or over",82,Human Trafficking,Involuntary Servitude,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4412,2019,KY0370000,Franklin,NaN,County,KY,Kentucky,East South Central,FRANKLIN,South,"10,000-24,999","Non-MSA counties from 10,000 thru 24,999",82,Human Trafficking,Involuntary Servitude,2,0,0,0
4413,2019,KY0370000,Franklin,NaN,County,KY,Kentucky,East South Central,FRANKLIN,South,"10,000-24,999","Non-MSA counties from 10,000 thru 24,999",82,Human Trafficking,Involuntary Servitude,1,0,0,0
4414,2020,KY0370000,Franklin,NaN,County,KY,Kentucky,East South Central,FRANKLIN,South,"10,000-24,999","Non-MSA counties from 10,000 thru 24,999",81,Human Trafficking,Commercial Sex Acts,1,0,0,0
4415,2020,KY0370000,Franklin,NaN,County,KY,Kentucky,East South Central,FRANKLIN,South,"10,000-24,999","Non-MSA counties from 10,000 thru 24,999",81,Human Trafficking,Commercial Sex Acts,1,0,0,0
4416,2020,KY0370000,Franklin,NaN,County,KY,Kentucky,East South Central,FRANKLIN,South,"10,000-24,999","Non-MSA counties from 10,000 thru 24,999",81,Human Trafficking,Commercial Sex Acts,1,0,0,0

In [5]:
reduced_hf_df = human_traffic_df[["DATA_YEAR", "ORI", "STATE_NAME", "COUNTY_NAME",
                                    "REGION_NAME", "POPULATION_GROUP_CODE", "OFFENSE_NAME", "OFFENSE_SUBCAT_NAME", "ACTUAL_COUNT", "UNFOUNDED_COUNT", "CLEARED_COUNT", "JUVENILE_CLEARED_COUNT"]]
reduced_hf_df

,DATA_YEAR,ORI,STATE_NAME,COUNTY_NAME,REGION_NAME,POPULATION_GROUP_CODE,OFFENSE_NAME,OFFENSE_SUBCAT_NAME,ACTUAL_COUNT,UNFOUNDED_COUNT,CLEARED_COUNT,JUVENILE_CLEARED_COUNT
7,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,0,0
8,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
9,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,1,0
10,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,5,0,0,0
11,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
4412,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,2,0,0,0
4413,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,1,0,0,0
4414,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4415,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4416,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0

In [6]:
rename_ht_df = reduced_hf_df.rename(columns={'DATA_YEAR': 'Year', 'STATE_NAME': 'State', 'COUNTY_NAME': 'County', 'REGION_NAME': 'Region', 'POPULATION_GROUP_CODE': 'Population', 'OFFENSE_NAME': 'Offense Name', 'OFFENSE_SUBCAT_NAME': 'Offense Subcategory'})
rename_ht_df

,Year,ORI,State,County,Region,Population,Offense Name,Offense Subcategory,ACTUAL_COUNT,UNFOUNDED_COUNT,CLEARED_COUNT,JUVENILE_CLEARED_COUNT
7,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,0,0
8,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
9,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,1,0
10,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,5,0,0,0
11,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
4412,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,2,0,0,0
4413,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,1,0,0,0
4414,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4415,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4416,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0

In [7]:
rename_ht_df.dropna(subset = ["County"], inplace=True)
rename_ht_df

,Year,ORI,State,County,Region,Population,Offense Name,Offense Subcategory,ACTUAL_COUNT,UNFOUNDED_COUNT,CLEARED_COUNT,JUVENILE_CLEARED_COUNT
7,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,0,0
8,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
9,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,2,0,1,0
10,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Commercial Sex Acts,5,0,0,0
11,2020,GA0440200,Georgia,DEKALB,South,"100,000",Human Trafficking,Involuntary Servitude,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
4412,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,2,0,0,0
4413,2019,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Involuntary Servitude,1,0,0,0
4414,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4415,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0
4416,2020,KY0370000,Kentucky,FRANKLIN,South,"10,000-24,999",Human Trafficking,Commercial Sex Acts,1,0,0,0

In [8]:
new_ht_df = rename_ht_df.loc[::, ['Year', 'County', 'State', 'Offense Subcategory', 'ACTUAL_COUNT']]
new_ht_df

      Year    County     State    Offense Subcategory  ACTUAL_COUNT
7     2020    DEKALB   Georgia    Commercial Sex Acts             2
8     2020    DEKALB   Georgia  Involuntary Servitude             1
9     2020    DEKALB   Georgia    Commercial Sex Acts             2
10    2020    DEKALB   Georgia    Commercial Sex Acts             5
11    2020    DEKALB   Georgia  Involuntary Servitude             1
...    ...       ...       ...                    ...           ...
4412  2019  FRANKLIN  Kentucky  Involuntary Servitude             2
4413  2019  FRANKLIN  Kentucky  Involuntary Servitude             1
4414  2020  FRANKLIN  Kentucky    Commercial Sex Acts             1
4415  2020  FRANKLIN  Kentucky    Commercial Sex Acts             1
4416  2020  FRANKLIN  Kentucky    Commercial Sex Acts             1

[1225 rows x 5 columns]

In [9]:
new_ht_df["County/State"] = new_ht_df["County"] + ','+ ' ' + new_ht_df["State"]
new_ht_df

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
7,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
8,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"
9,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
10,2020,DEKALB,Georgia,Commercial Sex Acts,5,"DEKALB, Georgia"
11,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"
...,...,...,...,...,...,...
4412,2019,FRANKLIN,Kentucky,Involuntary Servitude,2,"FRANKLIN, Kentucky"
4413,2019,FRANKLIN,Kentucky,Involuntary Servitude,1,"FRANKLIN, Kentucky"
4414,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"
4415,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"
4416,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"

In [11]:
offense_2013 = new_ht_df.loc[new_ht_df['Year']== 2013]
offense_2013.head(40)

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
2168,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2169,2013,ST LOUIS,Missouri,Commercial Sex Acts,3,"ST LOUIS, Missouri"
2173,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2174,2013,ALLEN,Ohio,Commercial Sex Acts,1,"ALLEN, Ohio"
2175,2013,ALLEN,Ohio,Involuntary Servitude,1,"ALLEN, Ohio"
2177,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2278,2013,NELSON,Virginia,Commercial Sex Acts,1,"NELSON, Virginia"

In [16]:
offense_sum_2013 = offense_2013.groupby('Offense Subcategory').sum()
offense_sum_2013.loc[offense_sum_2013['Year'] > 2013, 'Year'] = 2013
offense_sum_2013.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2013             8
Involuntary Servitude  2013             1

In [18]:
offense_2014 = new_ht_df.loc[new_ht_df['Year']== 2014]
offense_2014.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
159,2014,MADISON,Illinois,Commercial Sex Acts,1,"MADISON, Illinois"
160,2014,RANDOLPH,Illinois,Commercial Sex Acts,1,"RANDOLPH, Illinois"
162,2014,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
222,2014,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
246,2014,BOONE,Missouri,Commercial Sex Acts,1,"BOONE, Missouri"

In [19]:
offense_sum_2014 = offense_2014.groupby('Offense Subcategory').sum()
offense_sum_2014.loc[offense_sum_2014['Year'] > 2014, 'Year'] = 2014
offense_sum_2014.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2014            53
Involuntary Servitude  2014            25

In [20]:
offense_2015 = new_ht_df.loc[new_ht_df['Year']== 2015]
offense_2015.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
48,2015,HENRICO,Virginia,Commercial Sex Acts,1,"HENRICO, Virginia"
217,2015,JIM WELLS,Texas,Commercial Sex Acts,3,"JIM WELLS, Texas"
223,2015,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
418,2015,WILLACY,Texas,Involuntary Servitude,2,"WILLACY, Texas"
420,2015,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"

In [21]:
offense_sum_2015 = offense_2015.groupby('Offense Subcategory').sum()
offense_sum_2015.loc[offense_sum_2015['Year'] > 2015, 'Year'] = 2015
offense_sum_2015.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2015            63
Involuntary Servitude  2015            27

In [22]:
offense_2016 = new_ht_df.loc[new_ht_df['Year']== 2016]
offense_2016.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
27,2016,GREGG,Texas,Commercial Sex Acts,1,"GREGG, Texas"
28,2016,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
29,2016,KLEBERG,Texas,Involuntary Servitude,4,"KLEBERG, Texas"
49,2016,HENRICO,Virginia,Commercial Sex Acts,5,"HENRICO, Virginia"
1101,2016,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"

In [23]:
offense_sum_2016 = offense_2016.groupby('Offense Subcategory').sum()
offense_sum_2016.loc[offense_sum_2016['Year'] > 2016, 'Year'] = 2016
offense_sum_2016.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2016           275
Involuntary Servitude  2016            50

In [24]:
offense_2017 = new_ht_df.loc[new_ht_df['Year']== 2017]
offense_2017.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
16,2017,JEFFERSON,Louisiana,Commercial Sex Acts,3,"JEFFERSON, Louisiana"
180,2017,JEFFERSON,Louisiana,Commercial Sex Acts,9,"JEFFERSON, Louisiana"
189,2017,ST LOUIS,Missouri,Commercial Sex Acts,3,"ST LOUIS, Missouri"
192,2017,KENT,Delaware,Commercial Sex Acts,3,"KENT, Delaware"
194,2017,HENNEPIN,Minnesota,Commercial Sex Acts,1,"HENNEPIN, Minnesota"

In [25]:
offense_sum_2017 = offense_2017.groupby('Offense Subcategory').sum()
offense_sum_2017.loc[offense_sum_2017['Year'] > 2017, 'Year'] = 2017
offense_sum_2017.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2017           218
Involuntary Servitude  2017           112

In [26]:
offense_2018 = new_ht_df.loc[new_ht_df['Year']== 2018]
offense_2018.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
18,2018,JEFFERSON,Louisiana,Commercial Sex Acts,4,"JEFFERSON, Louisiana"
25,2018,ADAMS,Colorado,Commercial Sex Acts,1,"ADAMS, Colorado"
45,2018,JACKSON,Michigan,Commercial Sex Acts,2,"JACKSON, Michigan"
144,2018,MONTGOMERY,Tennessee,Commercial Sex Acts,2,"MONTGOMERY, Tennessee"
174,2018,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"

In [27]:
offense_sum_2018 = offense_2018.groupby('Offense Subcategory').sum()
offense_sum_2018.loc[offense_sum_2018['Year'] > 2018, 'Year'] = 2018
offense_sum_2018.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2018           218
Involuntary Servitude  2018            59

In [29]:
offense_2019 = new_ht_df.loc[new_ht_df['Year']== 2019]
offense_2019.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
46,2019,JACKSON,Michigan,Involuntary Servitude,1,"JACKSON, Michigan"
87,2019,HENNEPIN,Minnesota,Commercial Sex Acts,3,"HENNEPIN, Minnesota"
90,2019,ISANTI,Minnesota,Commercial Sex Acts,1,"ISANTI, Minnesota"
118,2019,CHEROKEE,Georgia,Commercial Sex Acts,1,"CHEROKEE, Georgia"
135,2019,COWETA,Georgia,Commercial Sex Acts,1,"COWETA, Georgia"

In [30]:
offense_sum_2019 = offense_2019.groupby('Offense Subcategory').sum()
offense_sum_2019.loc[offense_sum_2019['Year'] > 2019, 'Year'] = 2019
offense_sum_2019.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2019           461
Involuntary Servitude  2019           107

In [31]:
offense_2020 = new_ht_df.loc[new_ht_df['Year']== 2020]
offense_2020.head()

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
7,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
8,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"
9,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
10,2020,DEKALB,Georgia,Commercial Sex Acts,5,"DEKALB, Georgia"
11,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"

In [32]:
offense_sum_2020 = offense_2020.groupby('Offense Subcategory').sum()
offense_sum_2020.loc[offense_sum_2020['Year'] > 2020, 'Year'] = 2020
offense_sum_2020.head(40)

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2020           605
Involuntary Servitude  2020           173

In [33]:
offense_append_df = offense_sum_2013.append(offense_sum_2014)
offense_append_df

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2013             8
Involuntary Servitude  2013             1
Commercial Sex Acts    2014            53
Involuntary Servitude  2014            25

In [34]:
offense_append_df_2 = offense_append_df.append(offense_sum_2015)
offense_append_df_3 = offense_append_df_2.append(offense_sum_2016)
offense_append_df_4 = offense_append_df_3.append(offense_sum_2017)
offense_append_df_5 = offense_append_df_4.append(offense_sum_2018)
offense_append_df_6 = offense_append_df_5.append(offense_sum_2019)
offense_append_df_7 = offense_append_df_6.append(offense_sum_2020)

offense_append_df_7

                       Year  ACTUAL_COUNT
Offense Subcategory
Commercial Sex Acts    2013             8
Involuntary Servitude  2013             1
Commercial Sex Acts    2014            53
Involuntary Servitude  2014            25
Commercial Sex Acts    2015            63
Involuntary Servitude  2015            27
Commercial Sex Acts    2016           275
Involuntary Servitude  2016            50
Commercial Sex Acts    2017           218
Involuntary Servitude  2017           112
Commercial Sex Acts    2018           218
Involuntary Servitude  2018            59
Commercial Sex Acts    2019           461
Involuntary Servitude  2019           107
Commercial Sex Acts    2020           605
Involuntary Servitude  2020           173

In [35]:
offense_append_df_7.reset_index(inplace=True)
offense_append_df_7

      Offense Subcategory  Year  ACTUAL_COUNT
0     Commercial Sex Acts  2013             8
1   Involuntary Servitude  2013             1
2     Commercial Sex Acts  2014            53
3   Involuntary Servitude  2014            25
4     Commercial Sex Acts  2015            63
5   Involuntary Servitude  2015            27
6     Commercial Sex Acts  2016           275
7   Involuntary Servitude  2016            50
8     Commercial Sex Acts  2017           218
9   Involuntary Servitude  2017           112
10    Commercial Sex Acts  2018           218
11  Involuntary Servitude  2018            59
12    Commercial Sex Acts  2019           461
13  Involuntary Servitude  2019           107
14    Commercial Sex Acts  2020           605
15  Involuntary Servitude  2020           173

In [36]:
offense_append_df_7.to_csv("Resources/ht_offense_2013_2020.csv",
                  encoding="utf-8", index=False, header=True)

In [37]:
ht_2013 = new_ht_df.loc[new_ht_df['Year']== 2013]
ht_2013.head(40)

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
2168,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2169,2013,ST LOUIS,Missouri,Commercial Sex Acts,3,"ST LOUIS, Missouri"
2173,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2174,2013,ALLEN,Ohio,Commercial Sex Acts,1,"ALLEN, Ohio"
2175,2013,ALLEN,Ohio,Involuntary Servitude,1,"ALLEN, Ohio"
2177,2013,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
2278,2013,NELSON,Virginia,Commercial Sex Acts,1,"NELSON, Virginia"

In [38]:
sum_2013 = ht_2013.groupby('County/State').sum()

sum_2013.head(40)

                    Year  ACTUAL_COUNT
County/State
ALLEN, Ohio         4026             2
NELSON, Virginia    2013             1
ST LOUIS, Missouri  8052             6

In [39]:
sum_2013.loc[sum_2013['Year'] > 2013, 'Year'] = 2013
sum_2013

                    Year  ACTUAL_COUNT
County/State
ALLEN, Ohio         2013             2
NELSON, Virginia    2013             1
ST LOUIS, Missouri  2013             6

In [40]:
ht_2014 = new_ht_df.loc[new_ht_df['Year']== 2014]
ht_2014

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
159,2014,MADISON,Illinois,Commercial Sex Acts,1,"MADISON, Illinois"
160,2014,RANDOLPH,Illinois,Commercial Sex Acts,1,"RANDOLPH, Illinois"
162,2014,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
222,2014,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
246,2014,BOONE,Missouri,Commercial Sex Acts,1,"BOONE, Missouri"
248,2014,SMITH,Texas,Involuntary Servitude,1,"SMITH, Texas"
260,2014,ARAPAHOE,Colorado,Involuntary Servitude,2,"ARAPAHOE, Colorado"
528,2014,ST LOUIS,Missouri,Involuntary Servitude,1,"ST LOUIS, Missouri"
533,2014,ARAPAHOE,Colorado,Commercial Sex Acts,2,"ARAPAHOE, Colorado"
534,2014,JEFFERSON,Colorado,Commercial Sex Acts,1,"JEFFERSON, Colorado"
536,2014,COOK,Illinois,Involuntary Servitude,1,"COOK, Illinois"
556,2014,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
604,2014,POLK,Minnesota,Commercial Sex Acts,1,"POLK, Minnesota"
1569,2014,HORRY,South Carolina,Commercial Sex Acts,1,"HORRY, South Carolina"
2183,2014,RANDOLPH,Illinois,Involuntary Servitude,1,"RANDOLPH, Illinois"
2185,2014,SANGAMON,Illinois,Commercial Sex Acts,6,"SANGAMON, Illinois"
3263,2014,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
3271,2014,COLLIER,Florida,Commercial Sex Acts,12,"COLLIER, Florida"
3272,2014,HILLSBOROUGH,Florida,Commercial Sex Acts,4,"HILLSBOROUGH, Florida"
3277,2014,INDIAN RIVER,Florida,Involuntary Servitude,3,"INDIAN RIVER, Florida"
3278,2014,LEE,Florida,Commercial Sex Acts,1,"LEE, Florida"
3287,2014,BEXAR,Texas,Involuntary Servitude,1,"BEXAR, Texas"
3288,2014,MANATEE,Florida,Commercial Sex Acts,1,"MANATEE, Florida"
3289,2014,ORANGE,Florida,Commercial Sex Acts,5,"ORANGE, Florida"
3291,2014,OSCEOLA,Florida,Commercial Sex Acts,4,"OSCEOLA, Florida"
3299,2014,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
3308,2014,BEXAR,Texas,Involuntary Servitude,1,"BEXAR, Texas"
3314,2014,BEXAR,Texas,Involuntary Servitude,1,"BEXAR, Texas"
3317,2014,CHAMBERS,Texas,Commercial Sex Acts,1,"CHAMBERS, Texas"
3322,2014,JIM WELLS,Texas,Involuntary Servitude,3,"JIM WELLS, Texas"
3324,2014,HARRIS,Texas,Commercial Sex Acts,3,"HARRIS, Texas"
3325,2014,HARRIS,Texas,Involuntary Servitude,3,"HARRIS, Texas"
3327,2014,JIM HOGG,Texas,Involuntary Servitude,1,"JIM HOGG, Texas"
3579,2014,CHAMBERS,Texas,Commercial Sex Acts,1,"CHAMBERS, Texas"
3582,2014,MADISON,Illinois,Commercial Sex Acts,1,"MADISON, Illinois"
3586,2014,JOHNSON,Tennessee,Commercial Sex Acts,1,"JOHNSON, Tennessee"
3590,2014,SANGAMON,Illinois,Commercial Sex Acts,1,"SANGAMON, Illinois"
3592,2014,LA SALLE,Texas,Involuntary Servitude,1,"LA SALLE, Texas"
3600,2014,WILLACY,Texas,Involuntary Servitude,3,"WILLACY, Texas"
3978,2014,SANGAMON,Illinois,Commercial Sex Acts,1,"SANGAMON, Illinois"

In [41]:
sum_2014 = ht_2014.groupby('County/State').sum()

sum_2014.head(40)

                       Year  ACTUAL_COUNT
County/State
ARAPAHOE, Colorado     4028             4
BEXAR, Texas           6042             3
BOONE, Missouri        2014             1
CHAMBERS, Texas        4028             2
COLLIER, Florida       2014            12
COOK, Illinois         2014             1
HARRIS, Texas          8056             8
HILLSBOROUGH, Florida  2014             4
HORRY, South Carolina  2014             1
INDIAN RIVER, Florida  2014             3
JEFFERSON, Colorado    2014             1
JIM HOGG, Texas        2014             1
JIM WELLS, Texas       2014             3
JOHNSON, Tennessee     2014             1
LA SALLE, Texas        2014             1
LEE, Florida           2014             1
MADISON, Illinois      4028             2
MANATEE, Florida       2014             1
ORANGE, Florida        2014             5
OSCEOLA, Florida       2014             4
POLK, Minnesota        2014             1
RANDOLPH, Illinois     4028             2
SANGAMON, Illinois     6042             8
SMITH, Texas           2014             1
ST LOUIS, Missouri     4028             2
WILLACY, Texas         6042             5

In [42]:
sum_2014.loc[sum_2014['Year'] > 2014, 'Year'] = 2014
sum_2014

                       Year  ACTUAL_COUNT
County/State
ARAPAHOE, Colorado     2014             4
BEXAR, Texas           2014             3
BOONE, Missouri        2014             1
CHAMBERS, Texas        2014             2
COLLIER, Florida       2014            12
COOK, Illinois         2014             1
HARRIS, Texas          2014             8
HILLSBOROUGH, Florida  2014             4
HORRY, South Carolina  2014             1
INDIAN RIVER, Florida  2014             3
JEFFERSON, Colorado    2014             1
JIM HOGG, Texas        2014             1
JIM WELLS, Texas       2014             3
JOHNSON, Tennessee     2014             1
LA SALLE, Texas        2014             1
LEE, Florida           2014             1
MADISON, Illinois      2014             2
MANATEE, Florida       2014             1
ORANGE, Florida        2014             5
OSCEOLA, Florida       2014             4
POLK, Minnesota        2014             1
RANDOLPH, Illinois     2014             2
SANGAMON, Illinois     2014             8
SMITH, Texas           2014             1
ST LOUIS, Missouri     2014             2
WILLACY, Texas         2014             5

In [43]:
ht_2015 = new_ht_df.loc[new_ht_df['Year']== 2015]
ht_2015

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
48,2015,HENRICO,Virginia,Commercial Sex Acts,1,"HENRICO, Virginia"
217,2015,JIM WELLS,Texas,Commercial Sex Acts,3,"JIM WELLS, Texas"
223,2015,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
418,2015,WILLACY,Texas,Involuntary Servitude,2,"WILLACY, Texas"
420,2015,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"
421,2015,MONTGOMERY,Maryland,Commercial Sex Acts,4,"MONTGOMERY, Maryland"
422,2015,ANOKA,Minnesota,Commercial Sex Acts,1,"ANOKA, Minnesota"
435,2015,ST LOUIS,Missouri,Commercial Sex Acts,4,"ST LOUIS, Missouri"
548,2015,ARAPAHOE,Colorado,Involuntary Servitude,1,"ARAPAHOE, Colorado"
549,2015,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"
563,2015,ANOKA,Minnesota,Commercial Sex Acts,1,"ANOKA, Minnesota"
564,2015,CARVER,Minnesota,Commercial Sex Acts,1,"CARVER, Minnesota"
580,2015,ARAPAHOE,Colorado,Involuntary Servitude,1,"ARAPAHOE, Colorado"
581,2015,ARAPAHOE,Colorado,Commercial Sex Acts,1,"ARAPAHOE, Colorado"
591,2015,SHELBY,Tennessee,Commercial Sex Acts,1,"SHELBY, Tennessee"
597,2015,GRAINGER,Tennessee,Involuntary Servitude,1,"GRAINGER, Tennessee"
628,2015,GREENVILLE,South Carolina,Commercial Sex Acts,2,"GREENVILLE, South Carolina"
629,2015,FAYETTE,Tennessee,Commercial Sex Acts,1,"FAYETTE, Tennessee"
638,2015,CARVER,Minnesota,Commercial Sex Acts,1,"CARVER, Minnesota"
643,2015,GREENVILLE,South Carolina,Commercial Sex Acts,1,"GREENVILLE, South Carolina"
648,2015,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"
649,2015,INGHAM,Michigan,Commercial Sex Acts,3,"INGHAM, Michigan"
655,2015,ALLEN,Ohio,Involuntary Servitude,1,"ALLEN, Ohio"
656,2015,ALLEN,Ohio,Commercial Sex Acts,1,"ALLEN, Ohio"
662,2015,BEXAR,Texas,Involuntary Servitude,1,"BEXAR, Texas"
665,2015,GREENVILLE,South Carolina,Commercial Sex Acts,1,"GREENVILLE, South Carolina"
673,2015,HARRIS,Texas,Involuntary Servitude,3,"HARRIS, Texas"
677,2015,JIM WELLS,Texas,Commercial Sex Acts,2,"JIM WELLS, Texas"
678,2015,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
682,2015,NEWTON,Texas,Commercial Sex Acts,1,"NEWTON, Texas"
683,2015,WILLACY,Texas,Involuntary Servitude,2,"WILLACY, Texas"
686,2015,NEWTON,Texas,Commercial Sex Acts,1,"NEWTON, Texas"
689,2015,BENTON,Washington,Commercial Sex Acts,1,"BENTON, Washington"
697,2015,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
702,2015,CARVER,Minnesota,Commercial Sex Acts,1,"CARVER, Minnesota"
975,2015,FILLMORE,Minnesota,Commercial Sex Acts,1,"FILLMORE, Minnesota"
979,2015,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
983,2015,GREENVILLE,South Carolina,Commercial Sex Acts,1,"GREENVILLE, South Carolina"
989,2015,GREENVILLE,South Carolina,Commercial Sex Acts,1,"GREENVILLE, South Carolina"
993,2015,FLOYD,Texas,Commercial Sex Acts,1,"FLOYD, Texas"
995,2015,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
996,2015,HARRIS,Texas,Commercial Sex Acts,2,"HARRIS, Texas"
998,2015,HARRIS,Texas,Involuntary Servitude,2,"HARRIS, Texas"
999,2015,HARRIS,Texas,Commercial Sex Acts,2,"HARRIS, Texas"
1003,2015,HARRIS,Texas,Involuntary Servitude,4,"HARRIS, Texas"
1004,2015,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
1007,2015,KIMBLE,Texas,Involuntary Servitude,1,"KIMBLE, Texas"
1059,2015,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"
1064,2015,WILLACY,Texas,Involuntary Servitude,3,"WILLACY, Texas"
1070,2015,FREDERICK,Maryland,Commercial Sex Acts,1,"FREDERICK, Maryland"
1075,2015,ARAPAHOE,Colorado,Involuntary Servitude,2,"ARAPAHOE, Colorado"
1076,2015,MONTGOMERY,Maryland,Commercial Sex Acts,1,"MONTGOMERY, Maryland"
1080,2015,NICOLLET,Minnesota,Commercial Sex Acts,2,"NICOLLET, Minnesota"
1086,2015,GREENVILLE,South Carolina,Commercial Sex Acts,4,"GREENVILLE, South Carolina"
1215,2015,HARRIS,Texas,Commercial Sex Acts,2,"HARRIS, Texas"
1617,2015,STEARNS,Minnesota,Commercial Sex Acts,1,"STEARNS, Minnesota"
1626,2015,BEE,Texas,Involuntary Servitude,1,"BEE, Texas"
1768,2015,INGHAM,Michigan,Commercial Sex Acts,1,"INGHAM, Michigan"
1887,2015,HENRICO,Virginia,Commercial Sex Acts,1,"HENRICO, Virginia"
3123,2015,LAURENS,South Carolina,Commercial Sex Acts,1,"LAURENS, South Carolina"

In [44]:
sum_2015 = ht_2015.groupby('County/State').sum()

sum_2015.head(40)

                             Year  ACTUAL_COUNT
County/State
ALLEN, Ohio                  4030             2
ANOKA, Minnesota             4030             2
ARAPAHOE, Colorado           8060             5
BEE, Texas                   2015             1
BENTON, Washington           2015             1
BEXAR, Texas                 2015             1
CARVER, Minnesota            6045             3
FAYETTE, Tennessee           2015             1
FILLMORE, Minnesota          2015             1
FLOYD, Texas                 2015             1
FREDERICK, Maryland          2015             1
GRAINGER, Tennessee          2015             1
GREENVILLE, South Carolina  12090            10
HARRIS, Texas               18135            18
HENRICO, Virginia            4030             2
HOWARD, Maryland             6045             3
INGHAM, Michigan             4030             4
JIM WELLS, Texas             4030             5
KIMBLE, Texas                2015             1
LAURENS, South Carolina      2015             1
MONTGOMERY, Maryland         4030             5
NEWTON, Texas                4030             2
NICOLLET, Minnesota          2015             2
SHELBY, Tennessee            2015             1
ST LOUIS, Missouri           6045             6
STEARNS, Minnesota           2015             1
WILLACY, Texas              10075             9

In [45]:
sum_2015.loc[sum_2015['Year'] > 2015, 'Year'] = 2015
sum_2015

                            Year  ACTUAL_COUNT
County/State
ALLEN, Ohio                 2015             2
ANOKA, Minnesota            2015             2
ARAPAHOE, Colorado          2015             5
BEE, Texas                  2015             1
BENTON, Washington          2015             1
BEXAR, Texas                2015             1
CARVER, Minnesota           2015             3
FAYETTE, Tennessee          2015             1
FILLMORE, Minnesota         2015             1
FLOYD, Texas                2015             1
FREDERICK, Maryland         2015             1
GRAINGER, Tennessee         2015             1
GREENVILLE, South Carolina  2015            10
HARRIS, Texas               2015            18
HENRICO, Virginia           2015             2
HOWARD, Maryland            2015             3
INGHAM, Michigan            2015             4
JIM WELLS, Texas            2015             5
KIMBLE, Texas               2015             1
LAURENS, South Carolina     2015             1
MONTGOMERY, Maryland        2015             5
NEWTON, Texas               2015             2
NICOLLET, Minnesota         2015             2
SHELBY, Tennessee           2015             1
ST LOUIS, Missouri          2015             6
STEARNS, Minnesota          2015             1
WILLACY, Texas              2015             9

In [46]:
ht_2016 = new_ht_df.loc[new_ht_df['Year']== 2016]
ht_2016

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
27,2016,GREGG,Texas,Commercial Sex Acts,1,"GREGG, Texas"
28,2016,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
29,2016,KLEBERG,Texas,Involuntary Servitude,4,"KLEBERG, Texas"
49,2016,HENRICO,Virginia,Commercial Sex Acts,5,"HENRICO, Virginia"
1101,2016,HOWARD,Maryland,Commercial Sex Acts,1,"HOWARD, Maryland"
...,...,...,...,...,...,...
4330,2016,KLEBERG,Texas,Involuntary Servitude,3,"KLEBERG, Texas"
4332,2016,ROOSEVELT,Montana,Commercial Sex Acts,1,"ROOSEVELT, Montana"
4336,2016,JEFFERSON,Louisiana,Commercial Sex Acts,17,"JEFFERSON, Louisiana"
4338,2016,GREENVILLE,South Carolina,Commercial Sex Acts,3,"GREENVILLE, South Carolina"
4351,2016,ST LOUIS,Missouri,Commercial Sex Acts,1,"ST LOUIS, Missouri"

In [47]:
sum_2016 = ht_2016.groupby('County/State').sum()

sum_2016.head(40)

                             Year  ACTUAL_COUNT
County/State
ALACHUA, Florida             2016             1
ALLEN, Ohio                  2016             1
ANNE ARUNDEL, Maryland       4032             2
ARAPAHOE, Colorado           4032             3
BELTRAMI, Minnesota          2016             1
BEXAR, Texas                 2016             1
BOSQUE, Texas                2016             1
CARBON, Wyoming              2016             2
CHAMPAIGN, Illinois          2016             1
CHEROKEE, Oklahoma           2016             1
CLACKAMAS, Oregon            2016             1
COLLIER, Florida             4032             4
COOKE, Texas                 2016             1
EATON, Michigan              2016             1
ESCAMBIA, Florida            2016             2
FORT BEND, Texas             4032             2
GREENVILLE, South Carolina  16128            13
GREGG, Texas                 2016             1
HARRIS, Texas               24192            23
HENRICO, Virginia            6048             7
HIDALGO, Texas               2016             1
HILLSBOROUGH, Florida        2016             2
HOWARD, Maryland             6048             6
HUTCHINSON, Texas            4032             3
JEFFERSON, Louisiana        24192           114
JIM WELLS, Texas             2016             1
JOHNSON, Tennessee           2016             1
KENT, Delaware               4032             2
KITSAP, Washington           2016             1
KLEBERG, Texas               6048             8
LEE, Florida                 2016             4
MCKENZIE, North Dakota       2016             1
MIAMI-DADE, Florida          2016            42
MONTGOMERY, Maryland         2016             1
NOLAN, Texas                 2016             1
ORANGE, Florida              2016             3
OSCEOLA, Florida             2016             1
OTTER TAIL, Minnesota        2016             1
PALM BEACH, Florida          2016             9
RANDOLPH, Illinois           4032             2

In [48]:
sum_2016.loc[sum_2016['Year'] > 2016, 'Year'] = 2016
sum_2016

                            Year  ACTUAL_COUNT
County/State
ALACHUA, Florida            2016             1
ALLEN, Ohio                 2016             1
ANNE ARUNDEL, Maryland      2016             2
ARAPAHOE, Colorado          2016             3
BELTRAMI, Minnesota         2016             1
BEXAR, Texas                2016             1
BOSQUE, Texas               2016             1
CARBON, Wyoming             2016             2
CHAMPAIGN, Illinois         2016             1
CHEROKEE, Oklahoma          2016             1
CLACKAMAS, Oregon           2016             1
COLLIER, Florida            2016             4
COOKE, Texas                2016             1
EATON, Michigan             2016             1
ESCAMBIA, Florida           2016             2
FORT BEND, Texas            2016             2
GREENVILLE, South Carolina  2016            13
GREGG, Texas                2016             1
HARRIS, Texas               2016            23
HENRICO, Virginia           2016             7
HIDALGO, Texas              2016             1
HILLSBOROUGH, Florida       2016             2
HOWARD, Maryland            2016             6
HUTCHINSON, Texas           2016             3
JEFFERSON, Louisiana        2016           114
JIM WELLS, Texas            2016             1
JOHNSON, Tennessee          2016             1
KENT, Delaware              2016             2
KITSAP, Washington          2016             1
KLEBERG, Texas              2016             8
LEE, Florida                2016             4
MCKENZIE, North Dakota      2016             1
MIAMI-DADE, Florida         2016            42
MONTGOMERY, Maryland        2016             1
NOLAN, Texas                2016             1
ORANGE, Florida             2016             3
OSCEOLA, Florida            2016             1
OTTER TAIL, Minnesota       2016             1
PALM BEACH, Florida         2016             9
RANDOLPH, Illinois          2016             2
ROOSEVELT, Montana          2016             1
SEMINOLE, Florida           2016             3
ST LOUIS, Minnesota         2016             1
ST LOUIS, Missouri          2016            11
SUSSEX, Delaware            2016            10
TANGIPAHOA, Louisiana       2016             1
VOLUSIA, Florida            2016             2
WHITE, Arkansas             2016             2
WILLACY, Texas              2016            20
WINNEBAGO, Illinois         2016             1

In [49]:
ht_2017 = new_ht_df.loc[new_ht_df['Year']== 2017]
ht_2017

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
16,2017,JEFFERSON,Louisiana,Commercial Sex Acts,3,"JEFFERSON, Louisiana"
180,2017,JEFFERSON,Louisiana,Commercial Sex Acts,9,"JEFFERSON, Louisiana"
189,2017,ST LOUIS,Missouri,Commercial Sex Acts,3,"ST LOUIS, Missouri"
192,2017,KENT,Delaware,Commercial Sex Acts,3,"KENT, Delaware"
194,2017,HENNEPIN,Minnesota,Commercial Sex Acts,1,"HENNEPIN, Minnesota"
...,...,...,...,...,...,...
4123,2017,WILLACY,Texas,Involuntary Servitude,1,"WILLACY, Texas"
4192,2017,HENRICO,Virginia,Commercial Sex Acts,1,"HENRICO, Virginia"
4356,2017,JEFFERSON,Louisiana,Commercial Sex Acts,2,"JEFFERSON, Louisiana"
4357,2017,WILLACY,Texas,Involuntary Servitude,2,"WILLACY, Texas"
4358,2017,HIDALGO,Texas,Involuntary Servitude,1,"HIDALGO, Texas"

In [50]:
sum_2017 = ht_2017.groupby('County/State').sum()

sum_2017.head(40)

                             Year  ACTUAL_COUNT
County/State
ARAPAHOE, Colorado           4034             2
AUSTIN, Texas                2017             1
BEXAR, Texas                 2017             1
BLUE EARTH, Minnesota        8068            10
BOWIE, Texas                 2017             1
BOX ELDER, Utah              2017             1
BRAZOS, Texas                2017             1
BROWN, Wisconsin            10085            12
CALEDONIA, Vermont           2017             1
CALHOUN, Michigan            2017             1
CAMDEN, Missouri             2017             1
CARVER, Minnesota            6051             3
CHAMBERS, Texas              6051             4
CHESTER, South Carolina      2017             1
CHITTENDEN, Vermont          4034             2
CLAIBORNE, Tennessee         2017             1
CROCKETT, Tennessee          2017             1
CROW WING, Minnesota         2017             1
DANE, Wisconsin              2017             3
DOUGLAS, Colorado            2017             1
FRANKLIN, Kentucky          30255            52
GALLATIN, Montana            2017             1
GREENVILLE, South Carolina  22187            20
HARDEMAN, Tennessee          2017             1
HARRIS, Texas               26221            25
HENNEPIN, Minnesota          2017             1
HENRICO, Virginia            8068             5
HIDALGO, Texas               2017             1
HOPKINS, Texas               2017             1
HOUSTON, Minnesota           4034             4
INGHAM, Michigan             2017             1
JACKSON, Michigan            2017             1
JEFFERSON, Colorado          4034             3
JEFFERSON, Louisiana        20170            51
KALAMAZOO, Michigan          2017             1
KANKAKEE, Illinois           2017             1
KENT, Delaware               4034             4
KITSAP, Washington           2017             1
KNOX, Tennessee              2017             1
LAFAYETTE, Louisiana         2017             1

In [51]:
sum_2017.loc[sum_2017['Year'] > 2017, 'Year'] = 2017
sum_2017

                       Year  ACTUAL_COUNT
County/State
ARAPAHOE, Colorado     2017             2
AUSTIN, Texas          2017             1
BEXAR, Texas           2017             1
BLUE EARTH, Minnesota  2017            10
BOWIE, Texas           2017             1
...                     ...           ...
WAYNE, Michigan        2017             1
WEBB, Texas            2017            43
WILLACY, Texas         2017             6
WINNEBAGO, Illinois    2017             2
WINONA, Minnesota      2017             2

[71 rows x 2 columns]

In [52]:
ht_2018 = new_ht_df.loc[new_ht_df['Year']== 2018]
ht_2018

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
18,2018,JEFFERSON,Louisiana,Commercial Sex Acts,4,"JEFFERSON, Louisiana"
25,2018,ADAMS,Colorado,Commercial Sex Acts,1,"ADAMS, Colorado"
45,2018,JACKSON,Michigan,Commercial Sex Acts,2,"JACKSON, Michigan"
144,2018,MONTGOMERY,Tennessee,Commercial Sex Acts,2,"MONTGOMERY, Tennessee"
174,2018,HARRIS,Texas,Commercial Sex Acts,1,"HARRIS, Texas"
...,...,...,...,...,...,...
4168,2018,ST LUCIE,Florida,Involuntary Servitude,1,"ST LUCIE, Florida"
4193,2018,PRINCE WILLIAM,Virginia,Commercial Sex Acts,1,"PRINCE WILLIAM, Virginia"
4217,2018,PRINCE WILLIAM,Virginia,Commercial Sex Acts,1,"PRINCE WILLIAM, Virginia"
4230,2018,BURNET,Texas,Involuntary Servitude,10,"BURNET, Texas"
4383,2018,JEFFERSON,Colorado,Commercial Sex Acts,2,"JEFFERSON, Colorado"

In [53]:
sum_2018 = ht_2018.groupby('County/State').sum()

sum_2018.head(40)

                               Year  ACTUAL_COUNT
County/State
ADAMS, Colorado                2018             1
ALLEN, Kentucky                2018             1
BAY, Michigan                  2018             1
BENSON, North Dakota           2018             1
BERKELEY, West Virginia        2018             2
BERRIEN, Michigan              2018             1
BEXAR, Texas                   2018             1
BOLLINGER, Missouri            2018             1
BOULDER, Colorado              2018             1
BULLITT, Kentucky              2018             1
BURNET, Texas                  2018            10
CARROLL, Virginia              2018             1
CHAMBERS, Texas                4036             2
CHEROKEE, South Carolina       2018             1
CHESTERFIELD, South Carolina   2018             1
CLINTON, Michigan              2018             1
COLLIER, Florida               2018             4
COMAL, Texas                   2018             1
CREEK, Oklahoma                2018             1
DALLAS, Texas                  2018             1
DODGE, Wisconsin               2018             1
DUBOIS, Indiana                2018             1
EL PASO, Colorado              2018             1
FAYETTE, West Virginia         2018             1
FORT BEND, Texas               2018             1
FRANKLIN, Kentucky             4036             5
FRANKLIN, Vermont              2018             1
FREEBORN, Minnesota            2018             1
GENESEE, Michigan              8072             4
GREENVILLE, South Carolina     4036             2
HAMILTON, Tennessee            2018             1
HARRIS, Texas                 10090            13
HARRISON, Mississippi          2018             1
HENNEPIN, Minnesota            8072             7
HENRICO, Virginia              6054             3
HERNANDO, Florida              4036            11
HILLSBOROUGH, Florida          2018             6
HORRY, South Carolina          2018             1
INGHAM, Michigan               4036             2
IOSCO, Michigan                2018             1

In [54]:
sum_2018.loc[sum_2018['Year'] > 2018, 'Year'] = 2018
sum_2018

                         Year  ACTUAL_COUNT
County/State
ADAMS, Colorado          2018             1
ALLEN, Kentucky          2018             1
BAY, Michigan            2018             1
BENSON, North Dakota     2018             1
BERKELEY, West Virginia  2018             2
...                       ...           ...
WASHINGTON, Vermont      2018             1
WAYNE, Michigan          2018             5
WEBB, Texas              2018             6
WILLACY, Texas           2018             2
WRIGHT, Minnesota        2018             2

[103 rows x 2 columns]

In [55]:
ht_2019 = new_ht_df.loc[new_ht_df['Year']== 2019]
ht_2019

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
46,2019,JACKSON,Michigan,Involuntary Servitude,1,"JACKSON, Michigan"
87,2019,HENNEPIN,Minnesota,Commercial Sex Acts,3,"HENNEPIN, Minnesota"
90,2019,ISANTI,Minnesota,Commercial Sex Acts,1,"ISANTI, Minnesota"
118,2019,CHEROKEE,Georgia,Commercial Sex Acts,1,"CHEROKEE, Georgia"
135,2019,COWETA,Georgia,Commercial Sex Acts,1,"COWETA, Georgia"
...,...,...,...,...,...,...
4366,2019,DODGE,Wisconsin,Commercial Sex Acts,1,"DODGE, Wisconsin"
4410,2019,FRANKLIN,Kentucky,Commercial Sex Acts,3,"FRANKLIN, Kentucky"
4411,2019,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"
4412,2019,FRANKLIN,Kentucky,Involuntary Servitude,2,"FRANKLIN, Kentucky"
4413,2019,FRANKLIN,Kentucky,Involuntary Servitude,1,"FRANKLIN, Kentucky"

In [56]:
sum_2019 = ht_2019.groupby('County/State').sum()

sum_2019.head(40)

                             Year  ACTUAL_COUNT
County/State
ACCOMACK, Virginia           2019             1
ALBEMARLE, Virginia          2019             1
ALLEN, Kentucky              2019             1
ALLEN, Ohio                  8076             6
AMHERST, Virginia            2019             1
ANNE ARUNDEL, Maryland      10095             8
ARAPAHOE, Colorado           2019             2
ARLINGTON, Virginia          4038             3
BAKER, Florida               2019             1
BALTIMORE, Maryland          4038             2
BELL, Texas                  6057             3
BERKELEY, West Virginia     10095            13
BERNALILLO, New Mexico       4038             2
BEXAR, Texas                 6057             3
BOSSIER, Louisiana           2019             1
BOWIE, Texas                 2019             1
BRADLEY, Tennessee           6057             4
BRAXTON, West Virginia       2019             2
BROOKE, West Virginia        2019             2
BROWN, Wisconsin             6057             4
CARSON CITY, Nevada          2019             1
CATAWBA, North Carolina      6057             4
CHAMBERS, Texas              2019             1
CHEROKEE, Georgia            2019             1
CHESTERFIELD, Virginia       2019             1
CHITTENDEN, Vermont          8076             4
CLAY, Indiana                2019             1
CLAYTON, Georgia             2019             1
CLEVELAND, North Carolina    2019             1
COBB, Georgia                2019             1
COLLIER, Florida             2019             3
CONCHO, Texas                2019             1
COOKE, Texas                 2019             1
COWETA, Georgia             16152            11
CUMBERLAND, North Carolina  14133            11
DEKALB, Georgia              2019             1
DODDRIDGE, West Virginia     2019             3
DODGE, Wisconsin             4038             2
DOUGLAS, Colorado            2019             2
DOUGLAS, Nebraska            6057             3

In [57]:
sum_2019.loc[sum_2019['Year'] > 2019, 'Year'] = 2019
sum_2019

                        Year  ACTUAL_COUNT
County/State
ACCOMACK, Virginia      2019             1
ALBEMARLE, Virginia     2019             1
ALLEN, Kentucky         2019             1
ALLEN, Ohio             2019             6
AMHERST, Virginia       2019             1
...                      ...           ...
WINNEBAGO, Illinois     2019             2
WINNEBAGO, Wisconsin    2019             1
WOOD, West Virginia     2019             4
WYOMING, West Virginia  2019             1
ZAVALA, Texas           2019             1

[164 rows x 2 columns]

In [58]:
ht_2020 = new_ht_df.loc[new_ht_df['Year']== 2020]
ht_2020

,Year,County,State,Offense Subcategory,ACTUAL_COUNT,County/State
7,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
8,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"
9,2020,DEKALB,Georgia,Commercial Sex Acts,2,"DEKALB, Georgia"
10,2020,DEKALB,Georgia,Commercial Sex Acts,5,"DEKALB, Georgia"
11,2020,DEKALB,Georgia,Involuntary Servitude,1,"DEKALB, Georgia"
...,...,...,...,...,...,...
4382,2020,STAFFORD,Virginia,Commercial Sex Acts,1,"STAFFORD, Virginia"
4385,2020,STAFFORD,Virginia,Commercial Sex Acts,1,"STAFFORD, Virginia"
4414,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"
4415,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"
4416,2020,FRANKLIN,Kentucky,Commercial Sex Acts,1,"FRANKLIN, Kentucky"

In [59]:
sum_2020 = ht_2020.groupby('County/State').sum()

sum_2020.head(40)

                           Year  ACTUAL_COUNT
County/State
ACCOMACK, Virginia         6060             3
ADAMS, Nebraska            2020             1
ALLEGHENY, Pennsylvania    4040             2
ALLEN, Ohio                2020             1
ANNE ARUNDEL, Maryland     2020             2
ASHLAND, Ohio              2020             1
ATASCOSA, Texas            4040             8
BAKER, Florida             2020             1
BALTIMORE, Maryland        2020             1
BEE, Texas                 2020             1
BELL, Texas                2020             1
BERKELEY, South Carolina   2020             1
BERKELEY, West Virginia   14140            10
BEXAR, Texas               2020             1
BIBB, Georgia              6060             8
BOONE, Kentucky            2020             1
BOONE, West Virginia       4040             3
BOSSIER, Louisiana         2020             1
BOX ELDER, Utah            4040             2
BRANTLEY, Georgia          4040             3
BRAXTON, West Virginia     2020             1
BROOKE, West Virginia      2020             1
BURNETT, Wisconsin         2020             1
CAMDEN, Missouri           2020             1
CAMPBELL, Wyoming          2020             1
CAROLINE, Virginia         2020             1
CARROLL, Virginia          2020             1
CARSON CITY, Nevada        2020             1
CARVER, Minnesota          2020             1
CASTRO, Texas              2020             1
CATAWBA, North Carolina    2020             2
CHAMBERS, Texas            6060             3
CHARLEVOIX, Michigan       2020             1
CHEROKEE, Georgia          2020             1
CHESTERFIELD, Virginia     4040             4
CLARK, Washington          2020             1
CLAYTON, Georgia          10100             8
COBB, Georgia             20200            16
COFFEE, Georgia            2020             1
COLLIER, Florida           2020             3

In [60]:
sum_2020.loc[sum_2020['Year'] > 2020, 'Year'] = 2020
sum_2020

                         Year  ACTUAL_COUNT
County/State
ACCOMACK, Virginia       2020             3
ADAMS, Nebraska          2020             1
ALLEGHENY, Pennsylvania  2020             2
ALLEN, Ohio              2020             1
ANNE ARUNDEL, Maryland   2020             2
...                       ...           ...
WHITFIELD, Georgia       2020             2
WOOD, West Virginia      2020             1
WRIGHT, Minnesota        2020             1
WYOMING, West Virginia   2020             1
ZAVALA, Texas            2020             2

[177 rows x 2 columns]

In [61]:
ht_append_df = sum_2013.append(sum_2014)
ht_append_df

                       Year  ACTUAL_COUNT
County/State
ALLEN, Ohio            2013             2
NELSON, Virginia       2013             1
ST LOUIS, Missouri     2013             6
ARAPAHOE, Colorado     2014             4
BEXAR, Texas           2014             3
BOONE, Missouri        2014             1
CHAMBERS, Texas        2014             2
COLLIER, Florida       2014            12
COOK, Illinois         2014             1
HARRIS, Texas          2014             8
HILLSBOROUGH, Florida  2014             4
HORRY, South Carolina  2014             1
INDIAN RIVER, Florida  2014             3
JEFFERSON, Colorado    2014             1
JIM HOGG, Texas        2014             1
JIM WELLS, Texas       2014             3
JOHNSON, Tennessee     2014             1
LA SALLE, Texas        2014             1
LEE, Florida           2014             1
MADISON, Illinois      2014             2
MANATEE, Florida       2014             1
ORANGE, Florida        2014             5
OSCEOLA, Florida       2014             4
POLK, Minnesota        2014             1
RANDOLPH, Illinois     2014             2
SANGAMON, Illinois     2014             8
SMITH, Texas           2014             1
ST LOUIS, Missouri     2014             2
WILLACY, Texas         2014             5

In [62]:
ht_append_df_2 = ht_append_df.append(sum_2015)
ht_append_df_2

                            Year  ACTUAL_COUNT
County/State
ALLEN, Ohio                 2013             2
NELSON, Virginia            2013             1
ST LOUIS, Missouri          2013             6
ARAPAHOE, Colorado          2014             4
BEXAR, Texas                2014             3
BOONE, Missouri             2014             1
CHAMBERS, Texas             2014             2
COLLIER, Florida            2014            12
COOK, Illinois              2014             1
HARRIS, Texas               2014             8
HILLSBOROUGH, Florida       2014             4
HORRY, South Carolina       2014             1
INDIAN RIVER, Florida       2014             3
JEFFERSON, Colorado         2014             1
JIM HOGG, Texas             2014             1
JIM WELLS, Texas            2014             3
JOHNSON, Tennessee          2014             1
LA SALLE, Texas             2014             1
LEE, Florida                2014             1
MADISON, Illinois           2014             2
MANATEE, Florida            2014             1
ORANGE, Florida             2014             5
OSCEOLA, Florida            2014             4
POLK, Minnesota             2014             1
RANDOLPH, Illinois          2014             2
SANGAMON, Illinois          2014             8
SMITH, Texas                2014             1
ST LOUIS, Missouri          2014             2
WILLACY, Texas              2014             5
ALLEN, Ohio                 2015             2
ANOKA, Minnesota            2015             2
ARAPAHOE, Colorado          2015             5
BEE, Texas                  2015             1
BENTON, Washington          2015             1
BEXAR, Texas                2015             1
CARVER, Minnesota           2015             3
FAYETTE, Tennessee          2015             1
FILLMORE, Minnesota         2015             1
FLOYD, Texas                2015             1
FREDERICK, Maryland         2015             1
GRAINGER, Tennessee         2015             1
GREENVILLE, South Carolina  2015            10
HARRIS, Texas               2015            18
HENRICO, Virginia           2015             2
HOWARD, Maryland            2015             3
INGHAM, Michigan            2015             4
JIM WELLS, Texas            2015             5
KIMBLE, Texas               2015             1
LAURENS, South Carolina     2015             1
MONTGOMERY, Maryland        2015             5
NEWTON, Texas               2015             2
NICOLLET, Minnesota         2015             2
SHELBY, Tennessee           2015             1
ST LOUIS, Missouri          2015             6
STEARNS, Minnesota          2015             1
WILLACY, Texas              2015             9

In [63]:
ht_append_df_3 = ht_append_df_2.append(sum_2016)
ht_append_df_3

                       Year  ACTUAL_COUNT
County/State
ALLEN, Ohio            2013             2
NELSON, Virginia       2013             1
ST LOUIS, Missouri     2013             6
ARAPAHOE, Colorado     2014             4
BEXAR, Texas           2014             3
...                     ...           ...
TANGIPAHOA, Louisiana  2016             1
VOLUSIA, Florida       2016             2
WHITE, Arkansas        2016             2
WILLACY, Texas         2016            20
WINNEBAGO, Illinois    2016             1

[106 rows x 2 columns]

In [64]:
ht_append_df_4 = ht_append_df_3.append(sum_2017)
ht_append_df_5 = ht_append_df_4.append(sum_2018)
ht_append_df_6 = ht_append_df_5.append(sum_2019)
ht_append_df_7 = ht_append_df_6.append(sum_2020)

ht_append_df_7

                        Year  ACTUAL_COUNT
County/State
ALLEN, Ohio             2013             2
NELSON, Virginia        2013             1
ST LOUIS, Missouri      2013             6
ARAPAHOE, Colorado      2014             4
BEXAR, Texas            2014             3
...                      ...           ...
WHITFIELD, Georgia      2020             2
WOOD, West Virginia     2020             1
WRIGHT, Minnesota       2020             1
WYOMING, West Virginia  2020             1
ZAVALA, Texas           2020             2

[621 rows x 2 columns]

In [65]:
ht_append_df_7.reset_index(inplace=True)
ht_append_df_7

               County/State  Year  ACTUAL_COUNT
0               ALLEN, Ohio  2013             2
1          NELSON, Virginia  2013             1
2        ST LOUIS, Missouri  2013             6
3        ARAPAHOE, Colorado  2014             4
4              BEXAR, Texas  2014             3
..                      ...   ...           ...
616      WHITFIELD, Georgia  2020             2
617     WOOD, West Virginia  2020             1
618       WRIGHT, Minnesota  2020             1
619  WYOMING, West Virginia  2020             1
620           ZAVALA, Texas  2020             2

[621 rows x 3 columns]

In [ ]:
# Push the remade DataFrame to a new CSV file
ht_append_df_7.to_csv("Resources/ht_clean_final_2013_2020.csv",
                  encoding="utf-8", index=False, header=True)